Ran Plan for dir: `Terraform/Project/infrastructure` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/var/lib/atlantis/repos/IvanChet-4/DevOps_D/37/default/Terraform/Project/infrastructure/default.tfplan"' in '/var/lib/atlantis/repos/IvanChet-4/DevOps_D/37/default/Terraform/Project/infrastructure': exit status 1

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # yandex_vpc_network.default will be created
  + resource "yandex_vpc_network" "default" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "my-vpc"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.subnet1 will be created
  + resource "yandex_vpc_subnet" "subnet1" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-1"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.10.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.subnet2 will be created
  + resource "yandex_vpc_subnet" "subnet2" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-2"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.20.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.subnet3 will be created
  + resource "yandex_vpc_subnet" "subnet3" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-3"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.30.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
╷
│ Error: Invalid function argument
│ 
│   on main.tf line 57, in resource "yandex_compute_instance" "public_instance":
│   57:   ssh-keys = "${var.ssh_user}:${file(var.ssh_public_key)}"
│     ├────────────────
│     │ while calling file(path)
│     │ var.ssh_public_key is "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDcfSFNbBCAb8fmIFe/t4DYv53rUYywy5eXIRyD/8E8SkCkPHaarNz6v+RHjQUcTvWK02jx5mZAqUNu3guoQOOZI4e0mHnltUulOproQ/529Z+2lbkGibqacTwDd3QqHA0Ca4fwsFkIw3wK8oTvsc1VsiF/wuEvC3rHM80YN1AzmlJGeTrgO46SJ/OZLoap2NTHgKQp3H4sexqflzsQKNekDqmxt9VxGsIau3g75DDXTuENoTzq8VzbZMRxas3HW1oTarM6OUG2B7ycOvZI5+gB6GQuaAbxrBZISOjvGPsbZ23Bw0XWxgcQzTIV8iV8SV5GzUmt9sXWZLmOSM11W0z1yCP/DQgv9ZsSVjUuAzBRsvMs+SewrYIIumfMCKNVio4YxMZDD5Oted/In3ThC0f6wTXHvkSIoUHHKJ5sUvZ/c77mXr/B2XKAmqGZa7dappSESpfPXs//a1lX7W7ly3FBA1x74wd/cd02+pr46rRuhJFk2gb+zIkIAvWS3yCwPkYRFzVpnRjm7iBuwYJuxjNA0w3phCagYnUN9wv3N3xYgVBSO2w0Bk8/QBbmxJEO8qpFR2YL5K33D7iYzDpWlope7uECPFOXPOtqKv3K9hGAwXAW/4x7EWPOh5udb2keZZahUosAeX6tZmHMBTgB06IDKT4p9SqvQGTZbp2p7TxKNQ== user7@fhmr1p48if7pvl85j2h2"
│ 
│ Invalid value for "path" parameter: no file exists at "ssh-rsa
│ AAAAB3NzaC1yc2EAAAADAQABAAACAQDcfSFNbBCAb8fmIFe/t4DYv53rUYywy5eXIRyD/8E8SkCkPHaarNz6v+RHjQUcTvWK02jx5mZAqUNu3guoQOOZI4e0mHnltUulOproQ/529Z+2lbkGibqacTwDd3QqHA0Ca4fwsFkIw3wK8oTvsc1VsiF/wuEvC3rHM80YN1AzmlJGeTrgO46SJ/OZLoap2NTHgKQp3H4sexqflzsQKNekDqmxt9VxGsIau3g75DDXTuENoTzq8VzbZMRxas3HW1oTarM6OUG2B7ycOvZI5+gB6GQuaAbxrBZISOjvGPsbZ23Bw0XWxgcQzTIV8iV8SV5GzUmt9sXWZLmOSM11W0z1yCP/DQgv9ZsSVjUuAzBRsvMs+SewrYIIumfMCKNVio4YxMZDD5Oted/In3ThC0f6wTXHvkSIoUHHKJ5sUvZ/c77mXr/B2XKAmqGZa7dappSESpfPXs//a1lX7W7ly3FBA1x74wd/cd02+pr46rRuhJFk2gb+zIkIAvWS3yCwPkYRFzVpnRjm7iBuwYJuxjNA0w3phCagYnUN9wv3N3xYgVBSO2w0Bk8/QBbmxJEO8qpFR2YL5K33D7iYzDpWlope7uECPFOXPOtqKv3K9hGAwXAW/4x7EWPOh5udb2keZZahUosAeX6tZmHMBTgB06IDKT4p9SqvQGTZbp2p7TxKNQ==
│ user7@fhmr1p48if7pvl85j2h2"; this function works only with files that are
│ distributed as part of the configuration source code, so if this file will
│ be created by a resource in this configuration you must instead obtain this
│ result from an attribute of that resource.
╵
╷
│ Error: Invalid function argument
│ 
│   on main.tf line 57, in resource "yandex_compute_instance" "public_instance":
│   57:   ssh-keys = "${var.ssh_user}:${file(var.ssh_public_key)}"
│     ├────────────────
│     │ while calling file(path)
│     │ var.ssh_public_key is "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDcfSFNbBCAb8fmIFe/t4DYv53rUYywy5eXIRyD/8E8SkCkPHaarNz6v+RHjQUcTvWK02jx5mZAqUNu3guoQOOZI4e0mHnltUulOproQ/529Z+2lbkGibqacTwDd3QqHA0Ca4fwsFkIw3wK8oTvsc1VsiF/wuEvC3rHM80YN1AzmlJGeTrgO46SJ/OZLoap2NTHgKQp3H4sexqflzsQKNekDqmxt9VxGsIau3g75DDXTuENoTzq8VzbZMRxas3HW1oTarM6OUG2B7ycOvZI5+gB6GQuaAbxrBZISOjvGPsbZ23Bw0XWxgcQzTIV8iV8SV5GzUmt9sXWZLmOSM11W0z1yCP/DQgv9ZsSVjUuAzBRsvMs+SewrYIIumfMCKNVio4YxMZDD5Oted/In3ThC0f6wTXHvkSIoUHHKJ5sUvZ/c77mXr/B2XKAmqGZa7dappSESpfPXs//a1lX7W7ly3FBA1x74wd/cd02+pr46rRuhJFk2gb+zIkIAvWS3yCwPkYRFzVpnRjm7iBuwYJuxjNA0w3phCagYnUN9wv3N3xYgVBSO2w0Bk8/QBbmxJEO8qpFR2YL5K33D7iYzDpWlope7uECPFOXPOtqKv3K9hGAwXAW/4x7EWPOh5udb2keZZahUosAeX6tZmHMBTgB06IDKT4p9SqvQGTZbp2p7TxKNQ== user7@fhmr1p48if7pvl85j2h2"
│ 
│ Invalid value for "path" parameter: no file exists at "ssh-rsa
│ AAAAB3NzaC1yc2EAAAADAQABAAACAQDcfSFNbBCAb8fmIFe/t4DYv53rUYywy5eXIRyD/8E8SkCkPHaarNz6v+RHjQUcTvWK02jx5mZAqUNu3guoQOOZI4e0mHnltUulOproQ/529Z+2lbkGibqacTwDd3QqHA0Ca4fwsFkIw3wK8oTvsc1VsiF/wuEvC3rHM80YN1AzmlJGeTrgO46SJ/OZLoap2NTHgKQp3H4sexqflzsQKNekDqmxt9VxGsIau3g75DDXTuENoTzq8VzbZMRxas3HW1oTarM6OUG2B7ycOvZI5+gB6GQuaAbxrBZISOjvGPsbZ23Bw0XWxgcQzTIV8iV8SV5GzUmt9sXWZLmOSM11W0z1yCP/DQgv9ZsSVjUuAzBRsvMs+SewrYIIumfMCKNVio4YxMZDD5Oted/In3ThC0f6wTXHvkSIoUHHKJ5sUvZ/c77mXr/B2XKAmqGZa7dappSESpfPXs//a1lX7W7ly3FBA1x74wd/cd02+pr46rRuhJFk2gb+zIkIAvWS3yCwPkYRFzVpnRjm7iBuwYJuxjNA0w3phCagYnUN9wv3N3xYgVBSO2w0Bk8/QBbmxJEO8qpFR2YL5K33D7iYzDpWlope7uECPFOXPOtqKv3K9hGAwXAW/4x7EWPOh5udb2keZZahUosAeX6tZmHMBTgB06IDKT4p9SqvQGTZbp2p7TxKNQ==
│ user7@fhmr1p48if7pvl85j2h2"; this function works only with files that are
│ distributed as part of the configuration source code, so if this file will
│ be created by a resource in this configuration you must instead obtain this
│ result from an attribute of that resource.
╵
╷
│ Error: Invalid function argument
│ 
│   on main.tf line 57, in resource "yandex_compute_instance" "public_instance":
│   57:   ssh-keys = "${var.ssh_user}:${file(var.ssh_public_key)}"
│     ├────────────────
│     │ while calling file(path)
│     │ var.ssh_public_key is "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDcfSFNbBCAb8fmIFe/t4DYv53rUYywy5eXIRyD/8E8SkCkPHaarNz6v+RHjQUcTvWK02jx5mZAqUNu3guoQOOZI4e0mHnltUulOproQ/529Z+2lbkGibqacTwDd3QqHA0Ca4fwsFkIw3wK8oTvsc1VsiF/wuEvC3rHM80YN1AzmlJGeTrgO46SJ/OZLoap2NTHgKQp3H4sexqflzsQKNekDqmxt9VxGsIau3g75DDXTuENoTzq8VzbZMRxas3HW1oTarM6OUG2B7ycOvZI5+gB6GQuaAbxrBZISOjvGPsbZ23Bw0XWxgcQzTIV8iV8SV5GzUmt9sXWZLmOSM11W0z1yCP/DQgv9ZsSVjUuAzBRsvMs+SewrYIIumfMCKNVio4YxMZDD5Oted/In3ThC0f6wTXHvkSIoUHHKJ5sUvZ/c77mXr/B2XKAmqGZa7dappSESpfPXs//a1lX7W7ly3FBA1x74wd/cd02+pr46rRuhJFk2gb+zIkIAvWS3yCwPkYRFzVpnRjm7iBuwYJuxjNA0w3phCagYnUN9wv3N3xYgVBSO2w0Bk8/QBbmxJEO8qpFR2YL5K33D7iYzDpWlope7uECPFOXPOtqKv3K9hGAwXAW/4x7EWPOh5udb2keZZahUosAeX6tZmHMBTgB06IDKT4p9SqvQGTZbp2p7TxKNQ== user7@fhmr1p48if7pvl85j2h2"
│ 
│ Invalid value for "path" parameter: no file exists at "ssh-rsa
│ AAAAB3NzaC1yc2EAAAADAQABAAACAQDcfSFNbBCAb8fmIFe/t4DYv53rUYywy5eXIRyD/8E8SkCkPHaarNz6v+RHjQUcTvWK02jx5mZAqUNu3guoQOOZI4e0mHnltUulOproQ/529Z+2lbkGibqacTwDd3QqHA0Ca4fwsFkIw3wK8oTvsc1VsiF/wuEvC3rHM80YN1AzmlJGeTrgO46SJ/OZLoap2NTHgKQp3H4sexqflzsQKNekDqmxt9VxGsIau3g75DDXTuENoTzq8VzbZMRxas3HW1oTarM6OUG2B7ycOvZI5+gB6GQuaAbxrBZISOjvGPsbZ23Bw0XWxgcQzTIV8iV8SV5GzUmt9sXWZLmOSM11W0z1yCP/DQgv9ZsSVjUuAzBRsvMs+SewrYIIumfMCKNVio4YxMZDD5Oted/In3ThC0f6wTXHvkSIoUHHKJ5sUvZ/c77mXr/B2XKAmqGZa7dappSESpfPXs//a1lX7W7ly3FBA1x74wd/cd02+pr46rRuhJFk2gb+zIkIAvWS3yCwPkYRFzVpnRjm7iBuwYJuxjNA0w3phCagYnUN9wv3N3xYgVBSO2w0Bk8/QBbmxJEO8qpFR2YL5K33D7iYzDpWlope7uECPFOXPOtqKv3K9hGAwXAW/4x7EWPOh5udb2keZZahUosAeX6tZmHMBTgB06IDKT4p9SqvQGTZbp2p7TxKNQ==
│ user7@fhmr1p48if7pvl85j2h2"; this function works only with files that are
│ distributed as part of the configuration source code, so if this file will
│ be created by a resource in this configuration you must instead obtain this
│ result from an attribute of that resource.
╵


```
</details>